// const WELCOME_MESSAGE = `
// ✨ Здесь начинается безграничное пространство для творчества, где идеи оживают с помощью ИИ
//
// ***
//
// ➕ Создать новую карточку можно с помощью правой кнопки мыши или + на верхней панели.
// 🔗 Чтобы ИИ понимал контекст, карточки можно связать, кликнув на ● внизу или пункт "Продолжить" в меню ⋮  карточки.
// `;

export const NODES = [
  // {
  //   id: '1',
  //   type: 'node1',
  //   position: { x: 0, y: 0 },
  //   data: {
  //     title: "Начнем!  🚀 ",
  //     value: [
  //       {
  //         id: "start",
  //         text: WELCOME_MESSAGE,
  //       },
  //     ],
  //     output: [
  //       {
  //         id: "start",
  //         role: "assistant",
  //         content: [{ text: WELCOME_MESSAGE }],
  //       },
  //     ],
  //   },
  //
  //
  // },
  // { id: '2', data: {}, type: 'node2', width: 200, height: 100, position: { x: 490, y: 0 } },
  { id: '3', data: {}, type: 'node3', width: 200, height: 100, position: { x: 440, y: 200 } },
  { id: '4', data: {}, type: 'node4', width: 200, height: 100, position: { x: 440, y: 500 } }
];
